БухгалтерскиеЗадачиКР/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЭтоГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

БухгалтерскиеЗадачиКР/src/Constants/УчетДДС/ValueManagerModule.bsl
Процедура ПередЗаписью(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	УчетДДС.Значение КАК Значение
				   |ИЗ
				   |	Константа.УчетДДС КАК УчетДДС";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДополнительныеСвойства.Вставить("ЗначениеДо", ВыборкаДетальныеЗаписи.Значение);

	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	УчетДДС.Значение КАК Значение
				   |ИЗ
				   |	Константа.УчетДДС КАК УчетДДС";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	ДополнительныеСвойства.Вставить("ЗначениеПосле", ВыборкаДетальныеЗаписи.Значение);

	Если ДополнительныеСвойства.ЗначениеПосле <> ДополнительныеСвойства.ЗначениеДо Тогда

		Если ДополнительныеСвойства.ЗначениеПосле = Истина Тогда

			СписокСчетовУчетаДС = Новый СписокЗначений;
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.Касса);
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.СчетВБанке);
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.ВалютныйСчетВБанке);

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	Счета.Ссылка КАК Ссылка
						   |ИЗ
						   |	ПланСчетов.Счета КАК Счета
						   |ГДЕ
						   |	Счета.Ссылка В (&СписокСчетовУчетаДС)";

			Запрос.УстановитьПараметр("СписокСчетовУчетаДС", СписокСчетовУчетаДС);

		Иначе

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	СчетаВидыСубконто.Ссылка
						   |ИЗ
						   |	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
						   |ГДЕ
						   |	СчетаВидыСубконто.ВидСубконто = &ВидСубконто";

			Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств);

		КонецЕсли;

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ДанныеСчета = НаСервереМожноВызватьСКлиента.ПолучитьСвойствоСчета(ВыборкаДетальныеЗаписи.Ссылка);

			ПСОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

			Если ДополнительныеСвойства.ЗначениеПосле = Истина Тогда

				Если ДанныеСчета.КоличествоСубконто = 2 Тогда
					Продолжить;
				КонецЕсли;

				НоваяСтрока = ПСОбъект.ВидыСубконто.Добавить();
				НоваяСтрока.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств;

			Иначе

				СтрокаДляУдаления = ПСОбъект.ВидыСубконто.Найти(
					ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств, "ВидСубконто");

				ПСОбъект.ВидыСубконто.Удалить(СтрокаДляУдаления);

			КонецЕсли;

			ПСОбъект.Записать();

		КонецЦикла;

	КонецЕсли;
КонецПроцедуры
